In [1]:
import pandas as pd

In [2]:
dict1 = {'name':['홍길동', '홍길동', '김철수', '박영희', '김철수', '김철수', '홍길동'], 'korean': range(7)}
df1 = pd.DataFrame(dict1)
df1

  name  korean
0  홍길동       0
1  홍길동       1
2  김철수       2
3  박영희       3
4  김철수       4
5  김철수       5
6  홍길동       6

In [3]:
dict2 = {'name':['김철수', '홍길동', '심수봉'], 'english':range(3)}
df2 = pd.DataFrame(dict2)
df2

  name  english
0  김철수        0
1  홍길동        1
2  심수봉        2

In [12]:
pd.merge?

Signature:
pd.merge(
    left: 'DataFrame | Series',
    right: 'DataFrame | Series',
    how: 'MergeHow' = 'inner',
    on: 'IndexLabel | AnyArrayLike | None' = None,
    left_on: 'IndexLabel | AnyArrayLike | None' = None,
    right_on: 'IndexLabel | AnyArrayLike | None' = None,
    left_index: 'bool' = False,
    right_index: 'bool' = False,
    sort: 'bool' = False,
    suffixes: 'Suffixes' = ('_x', '_y'),
    copy: 'bool | None' = None,
    indicator: 'str | bool' = False,
    validate: 'str | None' = None,
) -> 'DataFrame'
Docstring:
Merge DataFrame or named Series objects with a database-style join.

A named Series object is treated as a DataFrame with a single named column.

The join is done on columns or indexes. If joining columns on
columns, the DataFrame indexes *will be ignored*. Otherwise if joining indexes
on indexes or indexes on a column or columns, the index will be passed on.
When performing a cross merge, no column specifications to merge on are
allowed.

.. warning::

    If both key columns contain rows where the key is a null value, those
    rows will be matched against each other. This is different from usual SQL
    join behaviour and can lead to unexpected results.

Parameters
----------
left : DataFrame or named Series
right : DataFrame or named Series
    Object to merge with.
how : {'left', 'right', 'outer', 'inner', 'cross'}, default 'inner'
    Type of merge to be performed.

    * left: use only keys from left frame, similar to a SQL left outer join;
      preserve key order.
    * right: use only keys from right frame, similar to a SQL right outer join;
      preserve key order.
    * outer: use union of keys from both frames, similar to a SQL full outer
      join; sort keys lexicographically.
    * inner: use intersection of keys from both frames, similar to a SQL inner
      join; preserve the order of the left keys.
    * cross: creates the cartesian product from both frames, preserves the order
      of the left keys.
on : label or list
    Column or index level names to join on. These must be found in both
    DataFrames. If `on` is None and not merging on indexes then this defaults
    to the intersection of the columns in both DataFrames.
left_on : label or list, or array-like
    Column or index level names to join on in the left DataFrame. Can also
    be an array or list of arrays of the length of the left DataFrame.
    These arrays are treated as if they are columns.
right_on : label or list, or array-like
    Column or index level names to join on in the right DataFrame. Can also
    be an array or list of arrays of the length of the right DataFrame.
    These arrays are treated as if they are columns.
left_index : bool, default False
    Use the index from the left DataFrame as the join key(s). If it is a
    MultiIndex, the number of keys in the other DataFrame (either the index
    or a number of columns) must match the number of levels.
right_index : bool, default False
    Use the index from the right DataFrame as the join key. Same caveats as
    left_index.
sort : bool, default False
    Sort the join keys lexicographically in the result DataFrame. If False,
    the order of the join keys depends on the join type (how keyword).
suffixes : list-like, default is ("_x", "_y")
    A length-2 sequence where each element is optionally a string
    indicating the suffix to add to overlapping column names in
    `left` and `right` respectively. Pass a value of `None` instead
    of a string to indicate that the column name from `left` or
    `right` should be left as-is, with no suffix. At least one of the
    values must not be None.
copy : bool, default True
    If False, avoid copy if possible.

    .. note::
        The `copy` keyword will change behavior in pandas 3.0.
        `Copy-on-Write
        <https://pandas.pydata.org/docs/dev/user_guide/copy_on_write.html>`__
        will be enabled by default, which means that all methods with a
        `copy` keyword will use a lazy copy mechanism to defer the copy and
        ignore the `copy` keyword. The `copy` keyword will be removed in a
        future version of pandas.

        You can already get the future behavior and improvements through
        enabling copy on write ``pd.options.mode.copy_on_write = True``
indicator : bool or str, default False
    If True, adds a column to the output DataFrame called "_merge" with
    information on the source of each row. The column can be given a different
    name by providing a string argument. The column will have a Categorical
    type with the value of "left_only" for observations whose merge key only
    appears in the left DataFrame, "right_only" for observations
    whose merge key only appears in the right DataFrame, and "both"
    if the observation's merge key is found in both DataFrames.

validate : str, optional
    If specified, checks if merge is of specified type.

    * "one_to_one" or "1:1": check if merge keys are unique in both
      left and right datasets.
    * "one_to_many" or "1:m": check if merge keys are unique in left
      dataset.
    * "many_to_one" or "m:1": check if merge keys are unique in right
      dataset.
    * "many_to_many" or "m:m": allowed, but does not result in checks.

Returns
-------
DataFrame
    A DataFrame of the two merged objects.

See Also
--------
merge_ordered : Merge with optional filling/interpolation.
merge_asof : Merge on nearest keys.
DataFrame.join : Similar method using indices.

Examples
--------
>>> df1 = pd.DataFrame({'lkey': ['foo', 'bar', 'baz', 'foo'],
...                     'value': [1, 2, 3, 5]})
>>> df2 = pd.DataFrame({'rkey': ['foo', 'bar', 'baz', 'foo'],
...                     'value': [5, 6, 7, 8]})
>>> df1
    lkey value
0   foo      1
1   bar      2
2   baz      3
3   foo      5
>>> df2
    rkey value
0   foo      5
1   bar      6
2   baz      7
3   foo      8

Merge df1 and df2 on the lkey and rkey columns. The value columns have
the default suffixes, _x and _y, appended.

>>> df1.merge(df2, left_on='lkey', right_on='rkey')
  lkey  value_x rkey  value_y
0  foo        1  foo        5
1  foo        1  foo        8
2  bar        2  bar        6
3  baz        3  baz        7
4  foo        5  foo        5
5  foo        5  foo        8

Merge DataFrames df1 and df2 with specified left and right suffixes
appended to any overlapping columns.

>>> df1.merge(df2, left_on='lkey', right_on='rkey',
...           suffixes=('_left', '_right'))
  lkey  value_left rkey  value_right
0  foo           1  foo            5
1  foo           1  foo            8
2  bar           2  bar            6
3  baz           3  baz            7
4  foo           5  foo            5
5  foo           5  foo            8

Merge DataFrames df1 and df2, but raise an exception if the DataFrames have
any overlapping columns.

>>> df1.merge(df2, left_on='lkey', right_on='rkey', suffixes=(False, False))
Traceback (most recent call last):
...
ValueError: columns overlap but no suffix specified:
    Index(['value'], dtype='object')

>>> df1 = pd.DataFrame({'a': ['foo', 'bar'], 'b': [1, 2]})
>>> df2 = pd.DataFrame({'a': ['foo', 'baz'], 'c': [3, 4]})
>>> df1
      a  b
0   foo  1
1   bar  2
>>> df2
      a  c
0   foo  3
1   baz  4

>>> df1.merge(df2, how='inner', on='a')
      a  b  c
0   foo  1  3

>>> df1.merge(df2, how='left', on='a')
      a  b  c
0   foo  1  3.0
1   bar  2  NaN

>>> df1 = pd.DataFrame({'left': ['foo', 'bar']})
>>> df2 = pd.DataFrame({'right': [7, 8]})
>>> df1
    left
0   foo
1   bar
>>> df2
    right
0   7
1   8

>>> df1.merge(df2, how='cross')
   left  right
0   foo      7
1   foo      8
2   bar      7
3   bar      8
File:      d:\kdt_2\anaconda3\lib\site-packages\pandas\core\reshape\merge.py
Type:      function

In [13]:
pd.merge(df1, df2, on='name')

  name  korean  english
0  홍길동       0        1
1  홍길동       1        1
2  김철수       2        0
3  김철수       4        0
4  김철수       5        0
5  홍길동       6        1

In [14]:
print("\n# how='outer' 라고 명시하면 full outer join이다.")
pd.merge(df1, df2, how='outer')

# how='outer' 라고 명시하면 full outer join이다.

  name  korean  english
0  김철수     2.0      0.0
1  김철수     4.0      0.0
2  김철수     5.0      0.0
3  박영희     3.0      NaN
4  심수봉     NaN      2.0
5  홍길동     0.0      1.0
6  홍길동     1.0      1.0
7  홍길동     6.0      1.0

In [15]:
pd.merge(df1, df2, how='right', suffixes = ['_x','_y'])

  name  korean  english
0  김철수     2.0        0
1  김철수     4.0        0
2  김철수     5.0        0
3  홍길동     0.0        1
4  홍길동     1.0        1
5  홍길동     6.0        1
6  심수봉     NaN        2

In [6]:
dict3 = {'leftkey':['홍길동', '홍길동', '김철수', '박영희', '김철수', '김철수', '홍길동'], 
         'korean': range(7)}
df3 = pd.DataFrame(dict3)
df3

  leftkey  korean
0     홍길동       0
1     홍길동       1
2     김철수       2
3     박영희       3
4     김철수       4
5     김철수       5
6     홍길동       6

In [7]:
dict4 = {'rightkey':['김철수', '홍길동', '심수봉'], 'english':range(3)}
df4 = pd.DataFrame(dict4)
df4

  rightkey  english
0      김철수        0
1      홍길동        1
2      심수봉        2

In [8]:
pd.merge( df3, df4, left_on='leftkey', right_on='rightkey')

  leftkey  korean rightkey  english
0     홍길동       0      홍길동        1
1     홍길동       1      홍길동        1
2     홍길동       6      홍길동        1
3     김철수       2      김철수        0
4     김철수       4      김철수        0
5     김철수       5      김철수        0

In [9]:
dict1 = {'key1':['김철수', '김철수', '박영희'], 
         'key2':['one', 'two', 'one'], 
         'leftval':[1, 2, 3]}
left = pd.DataFrame(dict1)
left

  key1 key2  leftval
0  김철수  one        1
1  김철수  two        2
2  박영희  one        3

In [10]:
dict2 = {'key1':['김철수', '김철수', '박영희', '박영희'], 
         'key2':['one', 'one', 'one', 'two'], 
         'leftval':[4, 5, 6, 7]}
right = pd.DataFrame(dict2)
right

  key1 key2  leftval
0  김철수  one        4
1  김철수  one        5
2  박영희  one        6
3  박영희  two        7

In [11]:
# 여러 개의 컬럼을 병합하려면, 컬럼 이름이 들어간 리스트를 넘겨 주면 됩니다.
mylist = ['key1', 'key2'] # 조인할 컬럼 리스트

#  여러 개의 컬럼 병합하기
pd.merge(left, right, on=mylist, how='outer')

  key1 key2  leftval_x  leftval_y
0  김철수  one        1.0        4.0
1  김철수  one        1.0        5.0
2  김철수  two        2.0        NaN
3  박영희  one        3.0        6.0
4  박영희  two        NaN        7.0

In [12]:
pd.merge(left, right, on='key1', suffixes=('_왼쪽', '_오른쪽'))

  key1 key2_왼쪽  leftval_왼쪽 key2_오른쪽  leftval_오른쪽
0  김철수     one           1      one            4
1  김철수     one           1      one            5
2  김철수     two           2      one            4
3  김철수     two           2      one            5
4  박영희     one           3      one            6
5  박영희     one           3      two            7

In [13]:
newdf1 = df1.set_index('name')
newdf1

      korean
name
홍길동        0
홍길동        1
김철수        2
박영희        3
김철수        4
김철수        5
홍길동        6

In [14]:
newdf2 = df2.set_index('name')
newdf2

      english
name
김철수         0
홍길동         1
심수봉         2

In [15]:
result = pd.merge(newdf1, newdf2, left_index=True, right_index=True, how='outer', indicator = True)
result

      korean  english      _merge
name
김철수      2.0      0.0        both
김철수      4.0      0.0        both
김철수      5.0      0.0        both
박영희      3.0      NaN   left_only
심수봉      NaN      2.0  right_only
홍길동      0.0      1.0        both
홍길동      1.0      1.0        both
홍길동      6.0      1.0        both